InformationRegisters/ПроцентныеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПроцентныеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентныхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Прогноз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗначения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПроцентныеПоказатели/Ext/ManagerModule.bsl
// Возвращает ближайшее прогнозное значение показателя
//
// Параметры:
//	Показатель					- ПеречислениеСсылка.ВидыПроцентныхПоказателей	- показатель
//	ДатаЗначения				- Дата											- дата, на которую определяется прогнозное значение
//	ИсточникПрогноза			- СправочникСсылка.ЮрФизЛица					- источник прогноза
//	ДатаАктуальности			- Дата											- дата, на которую строится срез прогнозов 
//	ВключатьДействующееЗначение	- Булево										- если действующее значение установлено ближе к дате актуальности, чем прогнозные, то возвращать его
//	РасшифровкаРасчета			- Структура, Неопределено						-
//
// Возвращаемое значение:
//	Число - прогнозное значение показателя, Неопределено - если не удалось получить прогнозное значение
//
Функция ПрогнозноеЗначениеПоказателя(Показатель, ДатаЗначения, ИсточникПрогноза, ДатаАктуальности, ВключатьДействующееЗначение = Ложь, РасшифровкаРасчета = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДействующееЗначение.Период КАК ДатаПубликации,
		|	ДействующееЗначение.ДатаЗначения КАК ДатаЗначения,
		|	ДействующееЗначение.ЗначениеПоказателя КАК Значение,
		|	ВЫБОР
		|		КОГДА ДействующееЗначение.Период < &ДатаЗначения
		|			ТОГДА РАЗНОСТЬДАТ(ДействующееЗначение.Период, &ДатаЗначения, ДЕНЬ)
		|		ИНАЧЕ РАЗНОСТЬДАТ(&ДатаЗначения, ДействующееЗначение.Период, ДЕНЬ)
		|	КОНЕЦ КАК ДнейДоЗначения,
		|	ДействующееЗначение.Прогноз КАК Прогноз
		|ПОМЕСТИТЬ _ВсеЗначения
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ПроцентныеПоказатели.Период КАК Период,
		|		ПроцентныеПоказатели.Прогноз КАК Прогноз,
		|		ПроцентныеПоказатели.ДатаЗначения КАК ДатаЗначения,
		|		ПроцентныеПоказатели.ЗначениеПоказателя КАК ЗначениеПоказателя
		|	ИЗ
		|		РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
		|	ГДЕ
		|		ПроцентныеПоказатели.Показатель = &Показатель
		|		И ПроцентныеПоказатели.Прогноз = ЛОЖЬ
		|		И ПроцентныеПоказатели.Период <= &ДатаАктуальности
		|		И ПроцентныеПоказатели.ДатаЗначения <= &ДатаЗначения
		|		И &ВключатьДействующееЗначение
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		ПроцентныеПоказатели.ДатаЗначения УБЫВ,
		|		ПроцентныеПоказатели.Период УБЫВ) КАК ДействующееЗначение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрогнозныеЗначения.Период,
		|	ПрогнозныеЗначения.ДатаЗначения,
		|	ПрогнозныеЗначения.ЗначениеПоказателя,
		|	ВЫБОР
		|		КОГДА ПрогнозныеЗначения.ДатаЗначения < &ДатаЗначения
		|			ТОГДА РАЗНОСТЬДАТ(ПрогнозныеЗначения.ДатаЗначения, &ДатаЗначения, ДЕНЬ)
		|		ИНАЧЕ РАЗНОСТЬДАТ(&ДатаЗначения, ПрогнозныеЗначения.ДатаЗначения, ДЕНЬ)
		|	КОНЕЦ,
		|	ПрогнозныеЗначения.Прогноз
		|ИЗ
		|	РегистрСведений.ПроцентныеПоказатели КАК ПрогнозныеЗначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПрогнозныеЗначения.Показатель КАК Показатель,
		|			ПрогнозныеЗначения.Прогноз КАК Прогноз,
		|			ПрогнозныеЗначения.Источник КАК Источник,
		|			МАКСИМУМ(ПрогнозныеЗначения.Период) КАК Период
		|		ИЗ
		|			РегистрСведений.ПроцентныеПоказатели КАК ПрогнозныеЗначения
		|		ГДЕ
		|			ПрогнозныеЗначения.Показатель = &Показатель
		|			И ПрогнозныеЗначения.Прогноз = ИСТИНА
		|			И ПрогнозныеЗначения.Источник = &ИсточникПрогноза
		|			И ПрогнозныеЗначения.Период <= &ДатаАктуальности
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПрогнозныеЗначения.Показатель,
		|			ПрогнозныеЗначения.Прогноз,
		|			ПрогнозныеЗначения.Источник) КАК ПоследнийПрогноз
		|		ПО (ПоследнийПрогноз.Период = ПрогнозныеЗначения.Период)
		|			И (ПоследнийПрогноз.Показатель = ПрогнозныеЗначения.Показатель)
		|			И (ПоследнийПрогноз.Прогноз = ПрогнозныеЗначения.Прогноз)
		|			И (ПоследнийПрогноз.Источник = ПрогнозныеЗначения.Источник)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеЗначения.ДатаПубликации КАК ДатаПубликации,
		|	_ВсеЗначения.ДатаЗначения КАК ДатаЗначения,
		|	_ВсеЗначения.Значение КАК Значение,
		|	_ВсеЗначения.Прогноз КАК Прогноз
		|ИЗ
		|	_ВсеЗначения КАК _ВсеЗначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ВсеЗначения.ДнейДоЗначения КАК ДнейДоЗначения,
		|			МАКСИМУМ(_ВсеЗначения.ДатаЗначения) КАК ДатаЗначения
		|		ИЗ
		|			_ВсеЗначения КАК _ВсеЗначения
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					МИНИМУМ(_ВсеЗначения.ДнейДоЗначения) КАК ДнейДоЗначения
		|				ИЗ
		|					_ВсеЗначения КАК _ВсеЗначения) КАК БлижайшееЗначение
		|				ПО (БлижайшееЗначение.ДнейДоЗначения = _ВсеЗначения.ДнейДоЗначения)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ВсеЗначения.ДнейДоЗначения) КАК ПоследнееБлижайшееЗначение
		|		ПО (ПоследнееБлижайшееЗначение.ДатаЗначения = _ВсеЗначения.ДатаЗначения)
		|			И (ПоследнееБлижайшееЗначение.ДнейДоЗначения = _ВсеЗначения.ДнейДоЗначения)");

	Запрос.УстановитьПараметр("Показатель",					 Показатель);
	Запрос.УстановитьПараметр("ДатаЗначения",				 ДатаЗначения);
	Запрос.УстановитьПараметр("ИсточникПрогноза",			 ИсточникПрогноза);
	Запрос.УстановитьПараметр("ДатаАктуальности",			 ДатаАктуальности);
	Запрос.УстановитьПараметр("ВключатьДействующееЗначение", ВключатьДействующееЗначение);

	Если РасшифровкаРасчета = Неопределено Тогда
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Иначе
		ВыборкаЗапроса = РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаРасчета, Запрос,
			СтрШаблон("Получение прогнозного значения показателя '%1'", Показатель), "ПрогнозноеЗначение", "Выборка", , , Истина);
	КонецЕсли;

	Возврат ?(ВыборкаЗапроса.Следующий(), ВыборкаЗапроса.Значение, Неопределено);
	
КонецФункции

// Возвращает действующее значение показателя на дату
//
// Параметры:
//	Показатель		- ПеречислениеСсылка.ВидыПроцентныхПоказателей	- показатель
//	ДатаЗначения	- Дата											- дата, на которую определяется значение показателя
//	Источник		- СправочникСсылка.ЮрФизЛица, Неопределено		- источник сведений, от которого зависят сведения о показателе
//
// Возвращаемое значение:
//	Число - значение показателя, Неопределено - если не удалось определить значение
//
Функция ЗначениеПоказателя(Показатель, ДатаЗначения, Источник = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПроцентныеПоказатели.ЗначениеПоказателя КАК Значение
		|ИЗ
		|	РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
		|ГДЕ
		|	ПроцентныеПоказатели.Показатель = &Показатель
		|	И ПроцентныеПоказатели.Прогноз = ЛОЖЬ
		|	И ПроцентныеПоказатели.Источник = &Источник
		|	И ПроцентныеПоказатели.Период <= &ДатаЗначения
		|	И ПроцентныеПоказатели.ДатаЗначения <= &ДатаЗначения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроцентныеПоказатели.ДатаЗначения УБЫВ,
		|	ПроцентныеПоказатели.Период УБЫВ");
	
	Если Источник = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПроцентныеПоказатели.Источник = &Источник", "ИСТИНА");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Показатель",		Показатель);
	Запрос.УстановитьПараметр("ДатаЗначения",	ДатаЗначения);
	Запрос.УстановитьПараметр("Источник",		Источник);

	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Возврат ?(ВыборкаЗапроса.Следующий(), ВыборкаЗапроса.Значение, Неопределено);
	
КонецФункции

// Возвращает, изменился ли показатель за период или нет
//
// Параметры:
//	Показатель			- ПеречислениеСсылка.ВидыПроцентныхПоказателей	- показатель
//	НачалоПериода		- Дата											- начало периода
//	КонецПериода		- Дата											- конец периода
//	Источник			- СправочникСсылка.ЮрФизЛица, Неопределено		- источник сведений, от которого зависят сведения о показателе
//	РасшифровкаРасчета	- Структура, Неопределено						-
//
// Возвращаемое значение:
//	Булево - показатель изменился, Неопределено - не удалось определить действующие значения показателя на границы периода
//
Функция ПоказательИзменилсяЗаПериод(Показатель, НачалоПериода, КонецПериода, Источник = Неопределено, ДатаАктуальности = Неопределено, РасшифровкаРасчета = Неопределено) Экспорт
	
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = КонецПериода;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Показатель КАК Показатель,
		|	&НачалоПериода КАК НачалоПериода,
		|	ПроцентныеПоказателиНаНачалоПериода.ЗначениеПоказателя КАК ЗначениеНаНачалоПериода,
		|	&КонецПериода КАК КонецПериода,
		|	ПроцентныеПоказателиНаКонецПериода.ЗначениеПоказателя КАК ЗначениеНаКонецПериода,
		|	ПроцентныеПоказателиНаНачалоПериода.ЗначениеПоказателя <> ПроцентныеПоказателиНаКонецПериода.ЗначениеПоказателя КАК ПоказательИзменился
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ПроцентныеПоказатели.ЗначениеПоказателя КАК ЗначениеПоказателя
		|	ИЗ
		|		РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
		|	ГДЕ
		|		ПроцентныеПоказатели.Показатель = &Показатель
		|		И ПроцентныеПоказатели.Прогноз = ЛОЖЬ
		|		И ПроцентныеПоказатели.Источник = &Источник
		|		И ПроцентныеПоказатели.Период <= &ДатаАктуальности
		|		И ПроцентныеПоказатели.ДатаЗначения <= &НачалоПериода
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		ПроцентныеПоказатели.ДатаЗначения УБЫВ,
		|		ПроцентныеПоказатели.Период УБЫВ) КАК ПроцентныеПоказателиНаНачалоПериода,
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ПроцентныеПоказатели.ЗначениеПоказателя КАК ЗначениеПоказателя
		|	ИЗ
		|		РегистрСведений.ПроцентныеПоказатели КАК ПроцентныеПоказатели
		|	ГДЕ
		|		ПроцентныеПоказатели.Показатель = &Показатель
		|		И ПроцентныеПоказатели.Прогноз = ЛОЖЬ
		|		И ПроцентныеПоказатели.Источник = &Источник
		|		И ПроцентныеПоказатели.Период <= &ДатаАктуальности
		|		И ПроцентныеПоказатели.ДатаЗначения <= &КонецПериода
		|	
		|	УПОРЯДОЧИТЬ ПО
		|		ПроцентныеПоказатели.ДатаЗначения УБЫВ,
		|		ПроцентныеПоказатели.Период УБЫВ) КАК ПроцентныеПоказателиНаКонецПериода");
	
	Если Источник = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПроцентныеПоказатели.Источник = &Источник", "ИСТИНА");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Показатель",			Показатель);
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",		КонецПериода);
	Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
	Запрос.УстановитьПараметр("Источник",			Источник);

	Если РасшифровкаРасчета = Неопределено Тогда
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Иначе
		ВыборкаЗапроса = РаботаСДокументами.ВыполнитьЗапросСРасшифровкойРезультата(РасшифровкаРасчета, Запрос, СтрШаблон("Проверка изменения показателя '%1'", Показатель), "Результат проверки", "Выборка", , , Истина);		
	КонецЕсли;
	
	Возврат ?(ВыборкаЗапроса.Следующий(), ВыборкаЗапроса.ПоказательИзменился, Неопределено);
	
КонецФункции
